In [2]:
import pandas as pd

In [3]:
data = [['2020-05-30', 'Headphone'], ['2020-06-01', 'Pencil'], ['2020-06-02', 'Mask'], ['2020-05-30', 'Basketball'], ['2020-06-01', 'Bible'], ['2020-06-02', 'Mask'], ['2020-05-30', 'T-Shirt']]
activities = pd.DataFrame(data, columns=['sell_date', 'product']).astype({'sell_date':'datetime64[ns]', 'product':'object'})

In [60]:
a=activities.groupby(['sell_date'])['product'].nunique().reset_index().rename(columns={'product':'num_sold'})
b=activities.groupby(['sell_date'])['product'].unique().reset_index().rename(columns={'product':'products'})
abc = pd.merge(a,b,on='sell_date')
abc['products'] = abc['products'].apply(lambda x:",".join(sorted(x)))
abc

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask

In [67]:


stats = activities.groupby(by='sell_date').agg(
    num_sold = ('product','nunique'),
    products = ('product', lambda x: ','.join(sorted(set(x))))
).reset_index()

stats

   sell_date  num_sold                      products
0 2020-05-30         3  Basketball,Headphone,T-Shirt
1 2020-06-01         2                  Bible,Pencil
2 2020-06-02         1                          Mask

In [68]:
data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

In [72]:
daily_sales.groupby(['date_id','make_name']).agg(unique_leads = ('lead_id','nunique'),unique_partners = ('partner_id','nunique')).reset_index().sort_values(by='make_name')

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
2 2020-12-08     honda             2                2
1 2020-12-07    toyota             1                2
3 2020-12-08    toyota             2                3

In [73]:
daily_sales.groupby(['date_id', 'make_name']).nunique().reset_index().rename(columns={'lead_id': 'unique_leads', 'partner_id': 'unique_partners'})

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3

In [74]:
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})

In [84]:
actor_director

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [108]:
new = actor_director.groupby(['actor_id','director_id']).agg(count=('director_id','count')).reset_index()
new[new['count']>=3][['actor_id','director_id']]

   actor_id  director_id
0         1            1